windborne/amslah/core/samd51defs.h
#define UART_SERCOM0_PA04_PA05 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PA05, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA04_PC16 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PC16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA04_PA09 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PA09, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA04_PB25 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PB25, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA04_PA06 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PA06, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA04_PC18 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PC18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA04_PA10 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PA10, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA04_PC24 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PC24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA04_PA07 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PA07, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA04_PC19 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PC19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA04_PA11 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PA11, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA04_PC25 .sercom=0, .pin_tx=PA04, .mux_tx=3, .pin_rx=PC25, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PC17_PA05 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PA05, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PC17_PC16 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PC16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PC17_PA09 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PA09, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PC17_PB25 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PB25, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PC17_PA06 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PA06, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PC17_PC18 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PC18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PC17_PA10 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PA10, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PC17_PC24 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PC24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PC17_PA07 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PA07, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PC17_PC19 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PC19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PC17_PA11 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PA11, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PC17_PC25 .sercom=0, .pin_tx=PC17, .mux_tx=3, .pin_rx=PC25, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA08_PA05 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PA05, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA08_PC16 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PC16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA08_PA09 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PA09, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA08_PB25 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PB25, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PA08_PA06 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PA06, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA08_PC18 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PC18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA08_PA10 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PA10, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA08_PC24 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PC24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PA08_PA07 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PA07, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA08_PC19 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PC19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA08_PA11 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PA11, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PA08_PC25 .sercom=0, .pin_tx=PA08, .mux_tx=2, .pin_rx=PC25, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PB24_PA05 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PA05, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PB24_PC16 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PC16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM0_PB24_PA09 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PA09, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PB24_PB25 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PB25, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM0_PB24_PA06 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PA06, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PB24_PC18 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PC18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM0_PB24_PA10 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PA10, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PB24_PC24 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PC24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM0_PB24_PA07 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PA07, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PB24_PC19 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PC19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM0_PB24_PA11 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PA11, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM0_PB24_PC25 .sercom=0, .pin_tx=PB24, .mux_tx=2, .pin_rx=PC25, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM0_PA05_PA07_PA04 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PA04 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PA04 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PA04 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA07_PC17 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PC17 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PC17 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PC17 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA07_PA08 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PA08 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PA08 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PA08 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA07_PB24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PB24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PB24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PB24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA05_PA04_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA07_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PA06 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA04_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA07_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PC18 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA04_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA07_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PA10 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA04_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA05_PA07_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC19_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA11_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PC25_PC24 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA05_PA04_PA07 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PA07 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PA07 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PA07 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA04_PC19 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PC19 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PC19 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PC19 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA04_PA11 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PA11 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PA11 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PA11 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA04_PC25 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PC17_PC25 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PA08_PC25 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA05_PB24_PC25 .sercom=0, .pin_sck=PA05, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA07_PA04 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PA04 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PA04 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PA04 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA07_PC17 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PC17 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PC17 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PC17 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA07_PA08 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PA08 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PA08 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PA08 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA07_PB24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PB24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PB24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PB24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PC16_PA04_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA07_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PA06 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA04_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA07_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PC18 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA04_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA07_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PA10 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA04_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PC16_PA07_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC19_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA11_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PC25_PC24 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PC16_PA04_PA07 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PA07 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PA07 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PA07 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA04_PC19 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PC19 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PC19 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PC19 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA04_PA11 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PA11 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA08_PA11 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PA11 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PA04_PC25 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PC17_PC25 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
