windborne/amslah/core/samd51defs.h
#define SPI_SERCOM0_PC16_PA08_PC25 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PC16_PB24_PC25 .sercom=0, .pin_sck=PC16, .mux_sck=3, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA07_PA04 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PA04 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PA04 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PA04 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA07_PC17 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PC17 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PC17 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PC17 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA07_PA08 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PA08 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PA08 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PA08 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA07_PB24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PB24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PB24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PB24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PA09_PA04_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA07_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PA06 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA04_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA07_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PC18 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA04_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA07_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PA10 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA04_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PA09_PA07_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC19_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA11_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PC25_PC24 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PA09_PA04_PA07 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PA07 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PA07 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PA07 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA04_PC19 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PC19 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PC19 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PC19 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA04_PA11 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PA11 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PA11 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PA11 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA04_PC25 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PC17_PC25 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PA08_PC25 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PA09_PB24_PC25 .sercom=0, .pin_sck=PA09, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA07_PA04 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PA04 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PA04 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PA04 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA04, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA07_PC17 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PC17 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PC17 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PC17 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA07_PA08 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PA08 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PA08 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PA08 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA08, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA07_PB24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PB24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PB24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PB24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PB24, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM0_PB25_PA04_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA07_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PA06 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA06, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA04_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA07_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PC18 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA04_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA07_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PA10 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PA10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA04_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM0_PB25_PA07_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA07, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC19_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=3, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA11_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PC25_PC24 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=2, .pin_miso=PC24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM0_PB25_PA04_PA07 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PA07 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PA07 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PA07 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA07, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA04_PC19 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PC19 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PC19 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PC19 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA04_PA11 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PA11 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PA11 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PA11 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PA11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA04_PC25 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA04, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PC17_PC25 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PC17, .mux_mosi=3, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PA08_PC25 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PA08, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM0_PB25_PB24_PC25 .sercom=0, .pin_sck=PB25, .mux_sck=2, .pin_mosi=PB24, .mux_mosi=2, .pin_miso=PC25, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM1_PA00_PA01 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PA01, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM1_PA00_PA17 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PA17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM1_PA00_PC28 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PC28, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM1_PA00_PA30 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PA30, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM1_PA00_PA18 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PA18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM1_PA00_PB22 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PB22, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM1_PA00_PA31 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PA31, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM1_PA00_PA19 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PA19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM1_PA00_PB23 .sercom=1, .pin_tx=PA00, .mux_tx=3, .pin_rx=PB23, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM1_PA16_PA01 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PA01, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM1_PA16_PA17 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PA17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM1_PA16_PC28 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PC28, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM1_PA16_PA30 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PA30, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM1_PA16_PA18 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PA18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM1_PA16_PB22 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PB22, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM1_PA16_PA31 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PA31, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM1_PA16_PA19 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PA19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM1_PA16_PB23 .sercom=1, .pin_tx=PA16, .mux_tx=2, .pin_rx=PB23, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM1_PC27_PA01 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PA01, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM1_PC27_PA17 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PA17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM1_PC27_PC28 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PC28, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM1_PC27_PA30 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PA30, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM1_PC27_PA18 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PA18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM1_PC27_PB22 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PB22, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM1_PC27_PA31 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PA31, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM1_PC27_PA19 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PA19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM1_PC27_PB23 .sercom=1, .pin_tx=PC27, .mux_tx=2, .pin_rx=PB23, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM1_PA01_PA31_PA00 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PA19_PA00 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PB23_PA00 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PA31_PA16 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PA19_PA16 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PB23_PA16 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PA31_PC27 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PA19_PC27 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PB23_PC27 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA01_PA00_PA30 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PA16_PA30 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PC27_PA30 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
