windborne/amslah/core/samd51defs.h
#define SPI_SERCOM1_PA01_PA31_PA30 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PA19_PA30 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PB23_PA30 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PA00_PA18 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PA16_PA18 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PC27_PA18 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PA31_PA18 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PA19_PA18 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PB23_PA18 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PA00_PB22 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PA16_PB22 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PC27_PB22 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA01_PA31_PB22 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PA19_PB22 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PB23_PB22 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA01_PA00_PA31 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PA16_PA31 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PC27_PA31 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PA00_PA19 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PA16_PA19 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PC27_PA19 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PA00_PB23 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PA16_PB23 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA01_PC27_PB23 .sercom=1, .pin_sck=PA01, .mux_sck=3, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PA31_PA00 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PA19_PA00 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PB23_PA00 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PA31_PA16 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PA19_PA16 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PB23_PA16 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PA31_PC27 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PA19_PC27 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PB23_PC27 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PA17_PA00_PA30 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PA16_PA30 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PC27_PA30 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PA31_PA30 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PA19_PA30 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PB23_PA30 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PA00_PA18 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PA16_PA18 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PC27_PA18 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PA31_PA18 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PA19_PA18 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PB23_PA18 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PA00_PB22 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PA16_PB22 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PC27_PB22 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PA17_PA31_PB22 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PA19_PB22 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PB23_PB22 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PA17_PA00_PA31 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PA16_PA31 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PC27_PA31 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PA00_PA19 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PA16_PA19 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PC27_PA19 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PA00_PB23 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PA16_PB23 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PA17_PC27_PB23 .sercom=1, .pin_sck=PA17, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PA31_PA00 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PA19_PA00 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PB23_PA00 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA00, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PA31_PA16 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PA19_PA16 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PB23_PA16 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PA31_PC27 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PA19_PC27 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PB23_PC27 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PC27, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM1_PC28_PA00_PA30 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PA16_PA30 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PC27_PA30 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PA31_PA30 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PA19_PA30 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PB23_PA30 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA30, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PA00_PA18 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PA16_PA18 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PC27_PA18 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PA31_PA18 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PA19_PA18 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PB23_PA18 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PA18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PA00_PB22 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PA16_PB22 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PC27_PB22 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM1_PC28_PA31_PB22 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=3, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PA19_PB22 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PB23_PB22 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=2, .pin_miso=PB22, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM1_PC28_PA00_PA31 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PA16_PA31 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PC27_PA31 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA31, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PA00_PA19 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PA16_PA19 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PC27_PA19 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PA19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PA00_PB23 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA00, .mux_mosi=3, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PA16_PB23 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PA16, .mux_mosi=2, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM1_PC28_PC27_PB23 .sercom=1, .pin_sck=PC28, .mux_sck=2, .pin_mosi=PC27, .mux_mosi=2, .pin_miso=PB23, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM2_PA09_PA08 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PA08, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM2_PA09_PB24 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PB24, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM2_PA09_PA13 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PA13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM2_PA09_PA10 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PA10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM2_PA09_PC24 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PC24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM2_PA09_PA14 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PA14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM2_PA09_PA11 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PA11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM2_PA09_PC25 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PC25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM2_PA09_PA15 .sercom=2, .pin_tx=PA09, .mux_tx=3, .pin_rx=PA15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM2_PB25_PA08 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PA08, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM2_PB25_PB24 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PB24, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM2_PB25_PA13 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PA13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM2_PB25_PA10 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PA10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM2_PB25_PC24 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PC24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM2_PB25_PA14 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PA14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM2_PB25_PA11 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PA11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM2_PB25_PC25 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PC25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM2_PB25_PA15 .sercom=2, .pin_tx=PB25, .mux_tx=3, .pin_rx=PA15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM2_PA12_PA08 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PA08, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM2_PA12_PB24 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PB24, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM2_PA12_PA13 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PA13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM2_PA12_PA10 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PA10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM2_PA12_PC24 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PC24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM2_PA12_PA14 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PA14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM2_PA12_PA11 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PA11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM2_PA12_PC25 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PC25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM2_PA12_PA15 .sercom=2, .pin_tx=PA12, .mux_tx=2, .pin_rx=PA15, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM2_PA08_PA11_PA09 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PC25_PA09 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PA15_PA09 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PA11_PB25 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PC25_PB25 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PA15_PB25 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PA11_PA12 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PC25_PA12 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PA15_PA12 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA08_PA09_PA10 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PB25_PA10 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PA12_PA10 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PA11_PA10 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PC25_PA10 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PA15_PA10 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PA09_PC24 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PB25_PC24 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PA12_PC24 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PA11_PC24 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PC25_PC24 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PA15_PC24 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PA09_PA14 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PB25_PA14 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PA12_PA14 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA08_PA11_PA14 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PC25_PA14 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PA15_PA14 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA08_PA09_PA11 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PB25_PA11 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PA12_PA11 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PA09_PC25 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PB25_PC25 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PA12_PC25 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PA09_PA15 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PB25_PA15 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA08_PA12_PA15 .sercom=2, .pin_sck=PA08, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PA11_PA09 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PC25_PA09 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PA15_PA09 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PA11_PB25 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PC25_PB25 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PA15_PB25 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PA11_PA12 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PC25_PA12 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PA15_PA12 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PB24_PA09_PA10 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
