windborne/amslah/core/samd51defs.h
#define SPI_SERCOM2_PB24_PB25_PA10 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PA12_PA10 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PA11_PA10 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PC25_PA10 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PA15_PA10 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PA09_PC24 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PB25_PC24 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PA12_PC24 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PA11_PC24 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PC25_PC24 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PA15_PC24 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PA09_PA14 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PB25_PA14 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PA12_PA14 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PB24_PA11_PA14 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PC25_PA14 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PA15_PA14 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PB24_PA09_PA11 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PB25_PA11 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PA12_PA11 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PA09_PC25 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PB25_PC25 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PA12_PC25 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PA09_PA15 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PB25_PA15 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PB24_PA12_PA15 .sercom=2, .pin_sck=PB24, .mux_sck=3, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PA11_PA09 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PC25_PA09 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PA15_PA09 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA09, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PA11_PB25 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PC25_PB25 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PA15_PB25 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PB25, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PA11_PA12 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PC25_PA12 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PA15_PA12 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM2_PA13_PA09_PA10 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PB25_PA10 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PA12_PA10 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PA11_PA10 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PC25_PA10 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PA15_PA10 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PA09_PC24 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PB25_PC24 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PA12_PC24 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PA11_PC24 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PC25_PC24 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PA15_PC24 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PC24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PA09_PA14 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PB25_PA14 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PA12_PA14 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM2_PA13_PA11_PA14 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA11, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PC25_PA14 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PC25, .mux_mosi=3, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PA15_PA14 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=2, .pin_miso=PA14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM2_PA13_PA09_PA11 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PB25_PA11 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PA12_PA11 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PA09_PC25 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PB25_PC25 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PA12_PC25 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PC25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PA09_PA15 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA09, .mux_mosi=3, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PB25_PA15 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PB25, .mux_mosi=3, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM2_PA13_PA12_PA15 .sercom=2, .pin_sck=PA13, .mux_sck=2, .pin_mosi=PA12, .mux_mosi=2, .pin_miso=PA15, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM3_PA17_PA16 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM3_PA17_PA23 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA23, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM3_PA17_PB21 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PB21, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM3_PA17_PA18 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM3_PA17_PA20 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA20, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM3_PA17_PA24 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM3_PA17_PA19 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM3_PA17_PA21 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA21, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM3_PA17_PA25 .sercom=3, .pin_tx=PA17, .mux_tx=3, .pin_rx=PA25, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM3_PA22_PA16 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM3_PA22_PA23 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA23, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM3_PA22_PB21 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PB21, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM3_PA22_PA18 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM3_PA22_PA20 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA20, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM3_PA22_PA24 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM3_PA22_PA19 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM3_PA22_PA21 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA21, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM3_PA22_PA25 .sercom=3, .pin_tx=PA22, .mux_tx=2, .pin_rx=PA25, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM3_PB20_PA16 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA16, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM3_PB20_PA23 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA23, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM3_PB20_PB21 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PB21, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM3_PB20_PA18 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM3_PB20_PA20 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA20, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM3_PB20_PA24 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA24, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM3_PB20_PA19 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM3_PB20_PA21 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA21, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM3_PB20_PA25 .sercom=3, .pin_tx=PB20, .mux_tx=2, .pin_rx=PA25, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM3_PA16_PA19_PA17 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA21_PA17 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA25_PA17 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA19_PA22 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA21_PA22 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA25_PA22 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA19_PB20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA21_PB20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA25_PB20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA16_PA17_PA18 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PA22_PA18 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PB20_PA18 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PA19_PA18 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA21_PA18 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA25_PA18 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA17_PA20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PA22_PA20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PB20_PA20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PA19_PA20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA21_PA20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA25_PA20 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA17_PA24 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PA22_PA24 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PB20_PA24 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA16_PA19_PA24 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA21_PA24 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA25_PA24 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA16_PA17_PA19 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PA22_PA19 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PB20_PA19 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PA17_PA21 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PA22_PA21 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PB20_PA21 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PA17_PA25 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PA22_PA25 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA16_PB20_PA25 .sercom=3, .pin_sck=PA16, .mux_sck=3, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PA19_PA17 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA21_PA17 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA25_PA17 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA19_PA22 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA21_PA22 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA25_PA22 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA19_PB20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA21_PB20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA25_PB20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PA23_PA17_PA18 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PA22_PA18 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PB20_PA18 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PA19_PA18 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA21_PA18 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA25_PA18 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA17_PA20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PA22_PA20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PB20_PA20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PA19_PA20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA21_PA20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA25_PA20 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA17_PA24 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PA22_PA24 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PB20_PA24 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PA23_PA19_PA24 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA21_PA24 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA25_PA24 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PA23_PA17_PA19 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PA22_PA19 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PB20_PA19 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PA17_PA21 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PA22_PA21 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PB20_PA21 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PA17_PA25 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PA22_PA25 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PA23_PB20_PA25 .sercom=3, .pin_sck=PA23, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PA19_PA17 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA21_PA17 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA25_PA17 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA17, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA19_PA22 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA21_PA22 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA25_PA22 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA22, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA19_PB20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA21_PB20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
