windborne/amslah/core/samd51defs.h
#define SPI_SERCOM3_PB21_PA25_PB20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PB20, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM3_PB21_PA17_PA18 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PA22_PA18 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PB20_PA18 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PA19_PA18 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA21_PA18 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA25_PA18 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA17_PA20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PA22_PA20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PB20_PA20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PA19_PA20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA21_PA20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA25_PA20 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA20, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA17_PA24 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PA22_PA24 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PB20_PA24 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM3_PB21_PA19_PA24 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA19, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA21_PA24 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=3, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA25_PA24 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=2, .pin_miso=PA24, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM3_PB21_PA17_PA19 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PA22_PA19 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PB20_PA19 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PA17_PA21 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PA22_PA21 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PB20_PA21 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA21, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PA17_PA25 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA17, .mux_mosi=3, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PA22_PA25 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PA22, .mux_mosi=2, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM3_PB21_PB20_PA25 .sercom=3, .pin_sck=PB21, .mux_sck=2, .pin_mosi=PB20, .mux_mosi=2, .pin_miso=PA25, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM4_PA13_PA12 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PA12, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM4_PA13_PB09 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PB09, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM4_PA13_PB13 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PB13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM4_PA13_PA14 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PA14, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM4_PA13_PB10 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PB10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM4_PA13_PB14 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PB14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM4_PA13_PB11 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PB11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM4_PA13_PA15 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PA15, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM4_PA13_PB15 .sercom=4, .pin_tx=PA13, .mux_tx=3, .pin_rx=PB15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM4_PB08_PA12 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PA12, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM4_PB08_PB09 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PB09, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM4_PB08_PB13 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PB13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM4_PB08_PA14 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PA14, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM4_PB08_PB10 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PB10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM4_PB08_PB14 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PB14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM4_PB08_PB11 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PB11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM4_PB08_PA15 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PA15, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM4_PB08_PB15 .sercom=4, .pin_tx=PB08, .mux_tx=3, .pin_rx=PB15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM4_PB12_PA12 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PA12, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM4_PB12_PB09 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PB09, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM4_PB12_PB13 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PB13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM4_PB12_PA14 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PA14, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM4_PB12_PB10 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PB10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM4_PB12_PB14 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PB14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM4_PB12_PB11 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PB11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM4_PB12_PA15 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PA15, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM4_PB12_PB15 .sercom=4, .pin_tx=PB12, .mux_tx=2, .pin_rx=PB15, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM4_PA12_PB11_PA13 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PA15_PA13 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PB15_PA13 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PB11_PB08 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PA15_PB08 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PB15_PB08 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PB11_PB12 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PA15_PB12 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PB15_PB12 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PA12_PA13_PA14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB08_PA14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB12_PA14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB11_PA14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PA15_PA14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PB15_PA14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PA13_PB10 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB08_PB10 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB12_PB10 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB11_PB10 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PA15_PB10 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PB15_PB10 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PA13_PB14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB08_PB14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB12_PB14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PA12_PB11_PB14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PA15_PB14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PB15_PB14 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PA12_PA13_PB11 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PB08_PB11 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PB12_PB11 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PA13_PA15 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PB08_PA15 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PB12_PA15 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PA13_PB15 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PB08_PB15 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PA12_PB12_PB15 .sercom=4, .pin_sck=PA12, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB11_PA13 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PA15_PA13 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PB15_PA13 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PB11_PB08 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PA15_PB08 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PB15_PB08 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PB11_PB12 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PA15_PB12 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PB15_PB12 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB09_PA13_PA14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB08_PA14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB12_PA14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB11_PA14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PA15_PA14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PB15_PA14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PA13_PB10 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB08_PB10 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB12_PB10 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB11_PB10 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PA15_PB10 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PB15_PB10 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PA13_PB14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB08_PB14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB12_PB14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB09_PB11_PB14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PA15_PB14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PB15_PB14 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB09_PA13_PB11 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB08_PB11 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB12_PB11 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PA13_PA15 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB08_PA15 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB12_PA15 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PA13_PB15 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB08_PB15 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB09_PB12_PB15 .sercom=4, .pin_sck=PB09, .mux_sck=3, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB11_PA13 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PA15_PA13 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PB15_PA13 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PA13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PB11_PB08 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PA15_PB08 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PB15_PB08 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB08, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PB11_PB12 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PA15_PB12 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PB15_PB12 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM4_PB13_PA13_PA14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB08_PA14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB12_PA14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB11_PA14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PA15_PA14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PB15_PA14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PA14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PA13_PB10 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB08_PB10 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB12_PB10 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB11_PB10 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PA15_PB10 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PB15_PB10 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PA13_PB14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB08_PB14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB12_PB14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM4_PB13_PB11_PB14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB11, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PA15_PB14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA15, .mux_mosi=3, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PB15_PB14 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB15, .mux_mosi=2, .pin_miso=PB14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM4_PB13_PA13_PB11 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB08_PB11 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB12_PB11 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PA13_PA15 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB08_PA15 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB12_PA15 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PA15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PA13_PB15 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PA13, .mux_mosi=3, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB08_PB15 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB08, .mux_mosi=3, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM4_PB13_PB12_PB15 .sercom=4, .pin_sck=PB13, .mux_sck=2, .pin_mosi=PB12, .mux_mosi=2, .pin_miso=PB15, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM5_PA23_PA22 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PA22, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PA23_PB03 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB03, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PA23_PB30 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB30, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PA23_PB17 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM5_PA23_PA24 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PA24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PA23_PB00 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB00, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PA23_PB22 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB22, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PA23_PA20 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PA20, .mux_rx=2, .txpo=0, .rxpo=2
