windborne/amslah/core/samd51defs.h
#define UART_SERCOM5_PA23_PB18 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PA23_PA25 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PA25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PA23_PB01 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB01, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PA23_PB23 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB23, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PA23_PA21 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PA21, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PA23_PB19 .sercom=5, .pin_tx=PA23, .mux_tx=3, .pin_rx=PB19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB02_PA22 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PA22, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB02_PB03 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB03, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB02_PB30 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB30, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB02_PB17 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB02_PA24 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PA24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB02_PB00 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB00, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB02_PB22 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB22, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB02_PA20 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PA20, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB02_PB18 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB02_PA25 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PA25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB02_PB01 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB01, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB02_PB23 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB23, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB02_PA21 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PA21, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB02_PB19 .sercom=5, .pin_tx=PB02, .mux_tx=3, .pin_rx=PB19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB31_PA22 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PA22, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB31_PB03 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB03, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB31_PB30 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB30, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB31_PB17 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB31_PA24 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PA24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB31_PB00 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB00, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB31_PB22 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB22, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB31_PA20 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PA20, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB31_PB18 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB31_PA25 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PA25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB31_PB01 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB01, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB31_PB23 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB23, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB31_PA21 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PA21, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB31_PB19 .sercom=5, .pin_tx=PB31, .mux_tx=3, .pin_rx=PB19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB16_PA22 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PA22, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB16_PB03 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB03, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB16_PB30 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB30, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB16_PB17 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM5_PB16_PA24 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PA24, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB16_PB00 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB00, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB16_PB22 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB22, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB16_PA20 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PA20, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB16_PB18 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM5_PB16_PA25 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PA25, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB16_PB01 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB01, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB16_PB23 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB23, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB16_PA21 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PA21, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM5_PB16_PB19 .sercom=5, .pin_tx=PB16, .mux_tx=2, .pin_rx=PB19, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM5_PA22_PA25_PA23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PA23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PA23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PA23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PA23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA25_PB02 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PB02 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PB02 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PB02 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PB02 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA25_PB31 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PB31 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PB31 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PB31 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PB31 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA25_PB16 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PB16 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PB16 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PB16 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PB16 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PA22_PA23_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PA25_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PA24 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA23_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PA25_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PB00 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA23_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PA25_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PB22 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA23_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PA25_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PA20 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA23_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PA22_PA25_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB01_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB23_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA21_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PB19_PB18 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PA22_PA23_PA25 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PA25 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PA25 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PA25 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PA23_PB01 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PB01 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PB01 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PB01 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PA23_PB23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PB23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PB23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PB23 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PA23_PA21 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PA21 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PA21 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PA21 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PA23_PB19 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB02_PB19 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB31_PB19 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PA22_PB16_PB19 .sercom=5, .pin_sck=PA22, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB03_PA25_PA23 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB01_PA23 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB23_PA23 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA21_PA23 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB19_PA23 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PA23, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA25_PB02 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB01_PB02 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB23_PB02 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA21_PB02 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB19_PB02 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB02, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA25_PB31 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB01_PB31 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB23_PB31 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA21_PB31 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB19_PB31 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB31, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA25_PB16 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB01_PB16 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB23_PB16 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA21_PB16 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PB19_PB16 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM5_PB03_PA23_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB02_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB31_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB16_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PA25_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PB01_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PB23_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PA21_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PB19_PA24 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PA24, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PA23_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB02_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB31_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB16_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PA25_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PB01_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PB23_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PA21_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PB19_PB00 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB03_PA23_PB22 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB02_PB22 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB03_PB31_PB22 .sercom=5, .pin_sck=PB03, .mux_sck=3, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
