windborne/amslah/core/samd51defs.h
#define SPI_SERCOM5_PB17_PA25_PB00 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB01_PB00 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB23_PB00 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA21_PB00 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB19_PB00 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB00, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA23_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PA25_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB01_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB23_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA21_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB19_PB22 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB22, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA23_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PA25_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB01_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB23_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA21_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB19_PA20 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PA20, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA23_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM5_PB17_PA25_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA25, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB01_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB01, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB23_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB23, .mux_mosi=3, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA21_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA21, .mux_mosi=2, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PB19_PB18 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=2, .pin_miso=PB18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM5_PB17_PA23_PA25 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PA25 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PA25 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PA25 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA25, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PA23_PB01 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PB01 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PB01 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PB01 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB01, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PA23_PB23 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PB23 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PB23 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PB23 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB23, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PA23_PA21 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PA21 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PA21 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PA21 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PA21, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PA23_PB19 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PA23, .mux_mosi=3, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB02_PB19 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB02, .mux_mosi=3, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB31_PB19 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB31, .mux_mosi=3, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM5_PB17_PB16_PB19 .sercom=5, .pin_sck=PB17, .mux_sck=2, .pin_mosi=PB16, .mux_mosi=2, .pin_miso=PB19, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM6_PC13_PC12 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC12, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM6_PC13_PC05 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC05, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM6_PC13_PC17 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM6_PC13_PC14 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC14, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC13_PC06 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC06, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC13_PC10 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC10, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC13_PC18 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC13_PC15 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC15, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC13_PC07 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC07, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC13_PC11 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC11, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC13_PC19 .sercom=6, .pin_tx=PC13, .mux_tx=3, .pin_rx=PC19, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC16_PC12 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC12, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM6_PC16_PC05 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC05, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM6_PC16_PC17 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC17, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM6_PC16_PC14 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC14, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC16_PC06 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC06, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC16_PC10 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC10, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC16_PC18 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC18, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM6_PC16_PC15 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC15, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC16_PC07 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC07, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC16_PC11 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC11, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM6_PC16_PC19 .sercom=6, .pin_tx=PC16, .mux_tx=2, .pin_rx=PC19, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM6_PC12_PC15_PC13 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC07_PC13 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC11_PC13 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC19_PC13 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC15_PC16 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC07_PC16 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC11_PC16 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC19_PC16 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC12_PC13_PC14 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC14 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC15_PC14 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC07_PC14 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC11_PC14 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC19_PC14 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC13_PC06 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC06 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC15_PC06 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC07_PC06 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC11_PC06 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC19_PC06 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC13_PC10 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC10 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC15_PC10 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC07_PC10 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC11_PC10 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC19_PC10 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC13_PC18 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC18 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC12_PC15_PC18 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC07_PC18 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC11_PC18 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC19_PC18 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC12_PC13_PC15 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC15 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC13_PC07 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC07, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC07 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC07, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC13_PC11 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC11 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC13_PC19 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC12_PC16_PC19 .sercom=6, .pin_sck=PC12, .mux_sck=3, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC15_PC13 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC07_PC13 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC11_PC13 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC19_PC13 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC15_PC16 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC07_PC16 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC11_PC16 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC19_PC16 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC05_PC13_PC14 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC14 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC15_PC14 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC07_PC14 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC11_PC14 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC19_PC14 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC13_PC06 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC06 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC15_PC06 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC07_PC06 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC11_PC06 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC19_PC06 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC13_PC10 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC10 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC15_PC10 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC07_PC10 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC11_PC10 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC19_PC10 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC13_PC18 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC18 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC05_PC15_PC18 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC07_PC18 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC11_PC18 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC19_PC18 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC05_PC13_PC15 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC15 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC13_PC07 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC07, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC07 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC07, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC13_PC11 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC11 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC13_PC19 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC05_PC16_PC19 .sercom=6, .pin_sck=PC05, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC15_PC13 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC07_PC13 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC11_PC13 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC19_PC13 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC13, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC15_PC16 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC07_PC16 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC11_PC16 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC19_PC16 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC16, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM6_PC17_PC13_PC14 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC14 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC15_PC14 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC07_PC14 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC11_PC14 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
