windborne/amslah/core/samd51defs.h
#define SPI_SERCOM6_PC17_PC19_PC14 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC14, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC13_PC06 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC06 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC15_PC06 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC07_PC06 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC11_PC06 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC19_PC06 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC06, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC13_PC10 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC10 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC15_PC10 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC07_PC10 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC11_PC10 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC19_PC10 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC10, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC13_PC18 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC18 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM6_PC17_PC15_PC18 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=3, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC07_PC18 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC07, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC11_PC18 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC19_PC18 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC19, .mux_mosi=2, .pin_miso=PC18, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM6_PC17_PC13_PC15 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC15 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC15, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC13_PC07 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC07, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC07 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC07, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC13_PC11 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC11 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC11, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC13_PC19 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC13, .mux_mosi=3, .pin_miso=PC19, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM6_PC17_PC16_PC19 .sercom=6, .pin_sck=PC17, .mux_sck=2, .pin_mosi=PC16, .mux_mosi=2, .pin_miso=PC19, .mux_miso=2, .dipo=3, .dopo=0
#define UART_SERCOM7_PB21_PB20 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PB20, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM7_PB21_PB31 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PB31, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM7_PB21_PC13 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PC13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM7_PB21_PB18 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PB18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB21_PC10 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PC10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB21_PC14 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PC14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB21_PA30 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PA30, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB21_PB19 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PB19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB21_PC11 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PC11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB21_PC15 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PC15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB21_PA31 .sercom=7, .pin_tx=PB21, .mux_tx=3, .pin_rx=PA31, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB30_PB20 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PB20, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM7_PB30_PB31 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PB31, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM7_PB30_PC13 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PC13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM7_PB30_PB18 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PB18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB30_PC10 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PC10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB30_PC14 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PC14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB30_PA30 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PA30, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM7_PB30_PB19 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PB19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB30_PC11 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PC11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB30_PC15 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PC15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM7_PB30_PA31 .sercom=7, .pin_tx=PB30, .mux_tx=2, .pin_rx=PA31, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM7_PC12_PB20 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PB20, .mux_rx=3, .txpo=0, .rxpo=1
#define UART_SERCOM7_PC12_PB31 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PB31, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM7_PC12_PC13 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PC13, .mux_rx=2, .txpo=0, .rxpo=1
#define UART_SERCOM7_PC12_PB18 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PB18, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM7_PC12_PC10 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PC10, .mux_rx=3, .txpo=0, .rxpo=2
#define UART_SERCOM7_PC12_PC14 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PC14, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM7_PC12_PA30 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PA30, .mux_rx=2, .txpo=0, .rxpo=2
#define UART_SERCOM7_PC12_PB19 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PB19, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM7_PC12_PC11 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PC11, .mux_rx=3, .txpo=0, .rxpo=3
#define UART_SERCOM7_PC12_PC15 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PC15, .mux_rx=2, .txpo=0, .rxpo=3
#define UART_SERCOM7_PC12_PA31 .sercom=7, .pin_tx=PC12, .mux_tx=2, .pin_rx=PA31, .mux_rx=2, .txpo=0, .rxpo=3
#define SPI_SERCOM7_PB20_PB19_PB21 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PB21 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PB21 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PB21 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PB19_PB30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PB30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PB30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PB30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PB19_PC12 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PC12 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PC12 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PC12 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB20_PB21_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB19_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PB18 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PB21_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB19_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PC10 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PB21_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB19_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PC14 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PB21_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB20_PB19_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC11_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PC15_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PA31_PA30 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB20_PB21_PB19 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PB19 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PB19 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB21_PC11 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PC11 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PC11 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB21_PC15 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PC15 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PC15 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB21_PA31 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PB30_PA31 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB20_PC12_PA31 .sercom=7, .pin_sck=PB20, .mux_sck=3, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB19_PB21 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PB21 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PB21 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PB21 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PB19_PB30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PB30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PB30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PB30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PB19_PC12 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PC12 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PC12 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PC12 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PB31_PB21_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB19_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PB18 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PB21_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB19_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PC10 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PB21_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB19_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PC14 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PB21_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PB31_PB19_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC11_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PC15_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PA31_PA30 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PB31_PB21_PB19 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PB19 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PB19 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB21_PC11 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PC11 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PC11 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB21_PC15 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PC15 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PC15 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB21_PA31 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PB30_PA31 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PB31_PC12_PA31 .sercom=7, .pin_sck=PB31, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB19_PB21 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PB21 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PC15_PB21 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PB21 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB21, .mux_miso=3, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PB19_PB30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PB30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
