windborne/amslah/core/samd51defs.h
#define SPI_SERCOM7_PC13_PC15_PB30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PB30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB30, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PB19_PC12 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PC12 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PC15_PC12 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PC12 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC12, .mux_miso=2, .dipo=0, .dopo=2
#define SPI_SERCOM7_PC13_PB21_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB19_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC15_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PB18 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PB18, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PB21_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB19_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC15_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PC10 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC10, .mux_miso=3, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PB21_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB19_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC15_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PC14 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PC14, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PB21_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=0
#define SPI_SERCOM7_PC13_PB19_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB19, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC11_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC11, .mux_mosi=3, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PC15_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC15, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PA31_PA30 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PA31, .mux_mosi=2, .pin_miso=PA30, .mux_miso=2, .dipo=2, .dopo=2
#define SPI_SERCOM7_PC13_PB21_PB19 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PB19 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PB19 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PB19, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB21_PC11 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PC11 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PC11 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC11, .mux_miso=3, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB21_PC15 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PC15 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PC15 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PC15, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB21_PA31 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB21, .mux_mosi=3, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PB30_PA31 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PB30, .mux_mosi=2, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
#define SPI_SERCOM7_PC13_PC12_PA31 .sercom=7, .pin_sck=PC13, .mux_sck=2, .pin_mosi=PC12, .mux_mosi=2, .pin_miso=PA31, .mux_miso=2, .dipo=3, .dopo=0
